{
  "transcript": "Very good. Let me just double check that you see my screen and you can hear me OK.\n\nOK, very good. All right. Well, welcome everybody. We will go through the following flow for an overview. I'm just going to give you an orientation of the application. We're going to just very briefly so that we can all be on the same page talk about. Language and wording that we use. Sort of referring it to the anatomy of an e-mail. And I think by understanding that then the demo of building an e-mail will be, you know, much quicker and easier to absorb. So then we'll build an e-mail, we'll design it, we'll test it and we'll mimic or replicate. You know what it means to broadcast your e-mail or campaign, whatever it is. We'll do it two times. Once we'll be just very, very quick just to show you the, you know, go ABC and D, but then we'll come back and we'll linger a little bit and go into more detail on a second pass and give you a little bit more advanced kind of tips and tricks as you're building your e-mail. We'll look at analytics just very quickly. We'll overview if we have time some advanced features. Kind of the idea of advanced teachers or little bonus time. As I say, I'll try to litter in additional productivity tips. We can talk about embedding video polls and quizzes and RSVP invites. A couple of the really slick capabilities inside of pros that is not available anywhere in the market, but in our app some AB testing we might just talk very high level on many of these at least to give you some sense of the more advanced features. We won't go through these or train you completely on these today there. Will be sort of deeper dive videos as Andrea was speaking about. OK. So with that in mind, let's just do a quick orientation of the anatomy of an e-mail for pros. So I put landing pages in there because you can use the application actually to create landing pages for your articles if you want. So I just want you to know they're the exact same process. We won't go through that, but that's another advanced idea. So here's your typical looking newsletter with the different sort of articles, if you will. And in a tailored mail slash prose way, what we call templates is just the wrapper of that content that you're going to write each time. You can create and there will be in the application several starter templates for you. They might have different headers. It is important to know just kind of as a rule of thumb, the footers that are in these templates are required by them, so they have the sort of the proper legal language, so you won't want to mess with footers. You'll want to keep them there. In a typical way, the old way, you might draft your entire e-mail inside of that template and call it a day, you know. In a newsletter since maybe you're creating 5-6-7 blocks of content, but in a prose way we call them content blocks and you can create just one and be done with it. But ideally you would create multiple ones for each different sort of article in a new newsletter sense. The reason for that is just a high level I'm sort of showing you why in the demo when we create what are called content blocks, I want you to at least have some context as to why they're really, really important. First, they could be individually targeted. They are bookmarkable by the recipients who receive them, so they can sort of save an article for viewing later. They're searchable and you, you know, if you so you can find individual blocks of content easier. They can be shared over teams or other formats as an individual block, as opposed to sharing the whole thing. If ever translation ends up being important, that's important. You can translate individual blocks, you can copy them to other emails. Or import them from other emails. So anyways you can see down the list. There are some important benefits to it all now in the content block and this is the final bit and then we'll build an. No. Whatever it is that you're building in your content block, I'll demonstrate how you first pick a layout. Like is it got one column or two columns or you know how do I want this sort of thing to lay out inside the e-mail and then there are drag and drop components. So when we use these words when a support person or Andrea is talking there will be a prose language, and so this is a bit of an overview of what templates are, what a content block is, yes. Picking a layout and drag and drop components. Now let's simplify all that and orient you to the app. So when you log in, you're met with the dashboard. Let me just give you this orientation and we'll build an e-mail. It's kind of showing you if you've got, you know, scheduled broadcasts or things in the past and you can hover over them and like them, you've got your menu structure down the left hand side to create content or view reports. Or to work with employees and their individual profiles. So those are kind of the three typical areas of the app and we've simplified it. You know, when you click it, there will be a menu structure of different options. And there will also be a couple of important things down here: help system, the ability to grab what we call the chooser. This is where images or files that you might want to include inside your emails or upload them here. This chooser is here and a flexible element for you. We'll go through that in our and you know, some charts and graphs of how your campaigns or emails are going, you do have the ability to chat for support. It's always sitting right here in the corner. You do have the ability to e-mail us, you know, if there's something important, you can, of course, call as well. Up here, when you log in, we're looking at Andrea's account here. But we call these things accounts or databases. So if you ever need support and somebody says what database are you in? That's right up here. You'd tell us I'm in Coms 3304 or you're in Corp tech. Or HR or marketing sales. When you guys log in, you are more than likely assigned to just one of these. Databases or accounts? They're secluded from each other. If you're in HR and you log in, you'll only see HR up here. And you won't see likely any of these others unless you were given permission or vice versa. Other people won't be lurking around and seeing what you're doing, so that's a very nice clean way of organizing each of you into different accounts or databases. OK, let's first do a quick walk through of creating an e-mail. So we call it really this project area that's a prose term these folders are what we call project folders in each account. If I just sort of flip through them, we've created some simple ones for you to get started and over here we call these additions. These are the actual emails that you're going to create, but as you'll see as I flip between these, there's already some starter stuff here and you can get right in and start playing with it. To create this little demo, I'm going to go over here to this project group and I'm going to click testing and there's a few emails that have been created here. What I can do if I want in this is something over time to create a new e-mail. You don't always have to come over here and say I want to create something new from scratch. You can go to a prior edition and as you hover over there's some helpful little links here. You can make a copy of something. It's a great way of, gosh, I went to all this work in the past. It has, you know, 5 things that I want to repeat or right over the top or whatever. You could come here and make an exact replica. It's like doing a save as to Word. But let's create a new addition. So a second pass of going through this as you're building your content. So let's view a couple of things from an editing standpoint in getting images into your content, there's several clever advanced things that are available to you. So if I were to go for example to your website and I found an image, you could find an image anywhere, you know, on the Internet frankly. But maybe there are little internal SharePoint sites and so forth that have good images that you want. You can copy an image. I'm just right mouse clicking an image from the Internet. I'm coming, you know, back here, I click on image now what I'm doing. I have a Mac is I'm going to do command V it will bring that image in automatically for me and I may say and it's going to place it on our servers. So this is ready to go. You didn't have to upload anything. We could have adjusted its width, we could have changed its alignment so as you're clicking on a particular element or component, we surround you with helpful sort of tools and elements. Here, if you wanted to hyperlink an image, it's as simple as placing it and then your full URL in here. OK, that's one buttons also have this sort of magic sidebar where you can say it says action button but you know you could just add the text and say you know read, read more whoops and then add your hyperlink. And then click OK and you can see as I'm making those edits, they are finding their way over here to the left in text here. Let's say, you know, I don't know. You wanted to bold something. As I mentioned, there is this bar up at the top. So you can make some quick edits. Uh. I'm going to, you know, sort of misspell something beyond the IT says no suggestions, but it did tell me that there that that was a misspelling, but I can create and add things to my own dictionary inside of here. I can come and hyperlink. How do you hyperlink?Next inside, so you would hit this link key up here and this is where you can now hyperlink to a SharePoint site or to a link somewhere else on your network. To you know, any other sort of intranet that might be available or a link externally as well. So it's as simple as just entering that and then it will be hyperlinked. Let's go ahead and actually do that and do them again. Dot com if you you know if I just click this, you'll see it does give it the default sort of color. Now what I could have done is come back here. Click this. Again, and I could say no, I want it to really be in one of my corporate colors. Whenever we give you the ability to change colors, these your corporate colors will follow you so you can quickly, you know, change that. And now it's, you know, change that inside of your content. One other quick thing that I want to do here is as you're bringing something. Offer and maybe you say, oh, I want to, you know, bring another block of text. You could have come over here and dragged it, but let you. There is a cool little copy feature. So you can, you know, hit this copy and it'll automatically make another copy of it. We could have dragged it around, you know, same with buttons. All that kind of stuff, this is where you could have added a video. We won't go through that for now, but as you bring in these little blue things, they're more dynamic in nature they have special capabilities where you can, you know, embed a video or bring in a poll or a quiz. This is a little bit of what that looks like when a video is in there, you know, it literally can play a video that's directly inside the e-mail, completely compatible throughout. You know your e-mail platforms. It could include bookmarks that it could include food ratings, or you want to share something with people over teams. It can include audio over time. If you do anything like internal podcasting, countdown clocks, image carousels, polls and quizzes that actually interact and animate in front of the employee and can optionally show them their answer versus the aggregate value across the enterprise quizzes version of. This is ask them a question and one of them is going to be right or wrong and it's going to tell you when you got it right or wrong. And. One, so these will be advanced capabilities that you can learn over time how to use. There is a complete library of, you know, some how-to stuff that will be available to you here that you can review. You know, like how to build gifts, how to use the image carousel, and so on and so forth. So anyways, this is your sort of drag and drop capability. And when you, you know, say save and close away you go and it's embedded inside of your e-mail and it's ready to go. Now. When you go to the test, a couple of advanced tips, we talked about the send. Well, first of all, let me before I start that you've got everything up here and it's correct. You can add coworkers and send, you know, to multiple people at one time if their names aren't in here and ready and available, you can paste their e-mail addresses in. In one per line. And it will also send a test to those coworkers. The send approval is saying hey, do I wanna, you know, have somebody approve one or more of these articles. So let's stop this here. It first shows you all your articles here. So if you just want to have somebody approve and look at one of them, select this and then say send approval if you want to review the whole e-mail. Make, you know, by default that's what it does. So when this comes up, you're able to now, you know, give it a name, ask when you want people to respond by like, I need to respond by next Thursday at X and next time frame. When are we proposing sending this on the 30th? What's my proposed subject line? It will remind, it'll send people this approval. It'll remind them X number of days before your deadline. If they still haven't responded. You give it a little subjective line of, you know, what you want people to see and learn and your own personal message. And then you click next and now you can pick the coworkers that are here. There's two ways. One is do you want them to just approve stuff and if so, you know, you can select a few of these or ohh. It's Andrea. Not only do I want her to approve it, I want Andrea to see all the interactions from these people. So that's the difference here. Ultimately, you can create combinations of them like I wanna, you know, have those three and use them over and over again, and then they will appear here for you. So that's the send approval flow. The other is the layout test. This was where I said you could say hey, I want to see what this thing looks like across some different Outlook clients, maybe mobile clients as well. You know what's going to look like on an iPhone? Yada yada. And I run the test and it's going. It uses a service called e-mail on acid. It's included in the application. Give it, you know, 15-20 seconds and it will come back and it will visually show you what they look like. And you can, you know, a light mode, dark mode, and so on and so forth. So those are all really important to make sure your emails look correct. In the broadcast function, again as we move forward, just a light notation, there is AB testing throughout the application. A simple one that I could explain here is hey, you just want to do some different subject lines like you just want to pick an A and B. What it'll do is half your list will get version A, half your list will get version B, and then when you view reports it will detail all of that for you, but we're not gonna do that. Under continue here when you set criteria. If these lists are not created, just a notation here that you will have the ability to create your own. There will be a tutorial separately on it, but this is where you will be able to choose. As Andrea said it, it integrates with Workday. So you'll be able to actually pick fields that are available that came over from Workday, like what job category or the manager level, people from a particular country, you know, when was there higher date and so on. And you can build, you know, complex AND/OR operations here and those get saved and the beauty is when we use the word dynamic, what we mean is every night as the new data is populated from Workday, your lists just automatically are updated. There will be no ongoing maintenance after you create your list. So that's a quick feature as a quick fallback, there is an e-mail paste and create. If you just need to quickly send to three or four people, you can come here to be able to paste some emails.\n\nThank you, So anyways, that was a key thing that I wanted to be able to describe here. Let's segue into reporting. If we go back here to projects just as I lean myself into this orientation, a very nice thing is very quickly you're going to be creating lots or there will be multiple authors in your account. And you're sort of all rubbing elbows against each other by default when you come to this page, it shows you the most recently created additions, and you can hover over them to quickly and visually see what they look like. You click one and it'll open it and you know you can edit it. As I said, you could copy it. There is a cool feature here where you can at any time whenever you see this sort of preview or play. This is in essence a live link of your content. You can share that with coworkers and as you make edits and hit save. All they have to do is refresh this link and they will see the latest version of what you've created, but a cool advanced feature here is something called Zen mode and if I go down here an e-mail that was sent out to all of you that used some of these advanced features was. Oops, that's not. The right one. It was a message from Rick, sort of the brand. Fresh. And you know, if we open it, you'll see there was some animation, there was an included video, and so on and so forth. If we go to the report for this broadcast, this is what the reporting looks like. It first gives you a high level overview of some statistics. What were the unique number of openers? That was sent to 5,600. It was opened by 66% of those people out of those 3,700 who opened, there were 455 who clicked something. And as we click this, it will drill down the report. This is the report you're going to look at 99% of the time. There are a lot of other trending reports that tell you the best day of week, best time of day, who the most active groups are. But this is the default information at a very high level. You know, it's showing us well how many clicks were there per person and was this viewed over mobile or desk? Up we drill down. It gives us some read time access that we split. How long was the e-mail opened or read? Was it glanced, skimmed, or read? Glanced is zero to 5 seconds. Skimmed is 5 to 20 and read is 21 or more. The score here of 89 is basically the read plus the skimmed that we're going to assume in this e-mail, 89% of the people who opened it, you know, at least engage with the content to some degree. So your more detailed information over here is, you know, I can drill any of these things and, you know, technically see who the most active people were and the number of clicks. So it's got a lot of detail that you could drill down. You can visually see what the content looks like from hot to cold, so you can see this is, you know, says, hey, somewhere in the 20 to 5 to 50% range was the video or different links are color-coded and so forth. You can look at things across an actual world map, but link by link are in these sub tabs and other sub reports so this can show us the performance of each link. We could have done some segmentation dicing by being able to, you know, say hey by, you know, region—these are the Workday fields—and it can slice and dice and show you what the open and click rates were across any of those kind of employee segments or properties that are built into the system. So that's reporting. There may be given that there's about four to five minutes left, Andrea, we could go into some questions or some advanced features, things like the RSVP invite feature I could explain. I'll let you perhaps direct.\n\nSome final points that you know we're important just as an overview. As you know, we talked about you're still responsible for getting SME approval. You must use the global.veem.com domain when sending to people and use the approved footers—a just a reinforcement that custom lists are more accurate than what you've been using, so there should be a dramatic improvement of your level of confidence on who you're sending to. I mentioned time zone sending. Be sure to give it at least 24 hours in advance before scheduling it to accurately deliver it at 9:00 AM, for example, around the world. And then don't forget you can reach out with chat inside the application. There is online help and additional videos. So that would be where I would leave it.\n\nSome final points that you know we're important just as an overview. As you know, we talked about you're still responsible for getting SME approval. You must use the. Global.veem.com domain when sending to people and use the approved footers a just a reinforcement that custom lists are more accurate than what you've been using, so there should be a dramatic improvement of your level of confidence on who you're sending to. I mentioned time zone sending. Be sure to give it at least 24 hours in advance before scheduling it to accurately deliver it at 9:00 AM, for example, around the world. And then don't forget you can reach out with chat inside the application. There is online help and additional videos. So that would be where I would leave it.\n\nThank you.\n\nSome final points that you know we're important just as an overview. As you know, we talked about you're still responsible for getting SME approval. You must use the. Global(company name).com domain when sending to people and use the approved footers—a just a reinforcement that custom lists are more accurate than what you've been using, so there should be a dramatic improvement of your level of confidence on who you're sending to. I mentioned time zone sending. Be sure to give it at least 24 hours in advance before scheduling it to accurately deliver it at 9:00 AM, for example, around the world. And then don't forget you can reach out with chat inside the application. There is online help and additional videos. So that would be where I would leave it.Thank you.",
  "questions": [
    {
      "question": "What is the purpose of templates in the application?",
      "answer": "Templates serve as the wrapper for your email content, providing a consistent structure with required footers containing legal language.",
      "variations": [
        "What role do templates play in email creation within the application?",
        "How are templates used when building emails in the application?",
        "Can you explain the function of templates in the application?",
        "What is the significance of templates in the email design process?",
        "How do templates help in organizing email content in the app?"
      ]
    },
    {
      "question": "What are content blocks and why are they important?",
      "answer": "Content blocks are individual sections within an email that allow for targeted content. They are important because they enable individual targeting, bookmarking, searching, sharing, translation, and easy copying or importing of content.",
      "variations": [
        "Can you describe what content blocks are and their significance?",
        "Why are content blocks essential in the email creation process?",
        "What are the benefits of using content blocks in your emails?",
        "How do content blocks enhance email functionality?",
        "What makes content blocks a crucial feature in the application?"
      ]
    },
    {
      "question": "How does the application handle different user accounts or databases?",
      "answer": "The application organizes users into separate accounts or databases based on departments or roles, ensuring that users only see and interact with content relevant to their assigned account, thereby maintaining privacy and organization.",
      "variations": [
        "How are user accounts managed within the application?",
        "What is the structure for organizing users in the application?",
        "How does the application segregate different user groups?",
        "Can you explain how the application handles multiple user accounts?",
        "How are departments or roles managed through accounts in the app?"
      ]
    },
    {
      "question": "What are the key components of the dashboard upon logging into the application?",
      "answer": "Upon logging in, the dashboard displays scheduled and past broadcasts, a menu structure on the left for creating content or viewing reports, employee profiles, a help system, the chooser for images or files, and support options like chat, email, and phone.",
      "variations": [
        "What features are available on the application's dashboard?",
        "Can you describe the main elements visible on the dashboard?",
        "What do you see when you first log into the application's dashboard?",
        "What components make up the dashboard interface?",
        "How is the dashboard organized in the application?"
      ]
    },
    {
      "question": "How can you create a new email addition in the application?",
      "answer": "To create a new email addition, navigate to the desired project folder, click on 'Additions', and either select 'New Addition' to start from scratch or use the 'Copy' option to duplicate an existing email.",
      "variations": [
        "What steps are involved in adding a new email to a project?",
        "How do you initiate the creation of a new email in a project folder?",
        "What is the process for creating a new email addition?",
        "How can you add a new email to your existing projects?",
        "What methods can you use to create a new email in the application?"
      ]
    },
    {
      "question": "Why should you avoid modifying the footer in email templates?",
      "answer": "The footers in email templates contain required legal language, so it's important to keep them intact to ensure compliance and proper legal disclosure.",
      "variations": [
        "Why is it important to leave the footer unchanged in templates?",
        "What is the significance of the footer in email templates?",
        "Why shouldn't you alter the footer in your email designs?",
        "What role does the footer play in email templates?",
        "Why must footers remain unmodified in the application's templates?"
      ]
    },
    {
      "question": "What advanced features can be added to emails using the application?",
      "answer": "Advanced features include embedding videos, polls, quizzes, RSVP invites, interactive elements like countdown clocks, image carousels, and dynamic content that can interact and animate for enhanced engagement.",
      "variations": [
        "What sophisticated elements can you incorporate into your emails?",
        "Which advanced functionalities are available for email customization?",
        "How can you enhance your emails with advanced features?",
        "What are some of the high-level features you can add to emails?",
        "What interactive elements can be embedded into emails using the application?"
      ]
    },
    {
      "question": "How does the 'Send Approval' feature work?",
      "answer": "The 'Send Approval' feature allows you to request approval for specific articles or the entire email from selected coworkers. You can set a deadline for responses, customize reminder messages, and track approvals within the application.",
      "variations": [
        "What is the function of the 'Send Approval' feature?",
        "How do you use the 'Send Approval' option in the application?",
        "Can you explain how the 'Send Approval' process works?",
        "What steps are involved in sending an approval request for an email?",
        "How does the application facilitate the approval of email content?"
      ]
    },
    {
      "question": "What is the purpose of the layout test feature?",
      "answer": "The layout test feature allows you to preview how your email will appear across different email clients and devices, ensuring that it looks correct in various environments before sending.",
      "variations": [
        "Why would you use the layout test feature in the application?",
        "How does the layout test help in email design?",
        "What benefits does the layout test provide for your emails?",
        "Can you describe the functionality of the layout test?",
        "How does the layout test ensure email compatibility?"
      ]
    },
    {
      "question": "How does A/B testing work in the broadcast function?",
      "answer": "A/B testing in the broadcast function allows you to create different versions of an email (e.g., different subject lines). The application then splits your audience into groups, sends each version to a different group, and provides detailed reports on performance to determine which version is more effective.",
      "variations": [
        "What is the process of conducting A/B testing in broadcasts?",
        "How can you implement A/B testing within the broadcast feature?",
        "Can you explain how A/B testing operates in the application?",
        "What steps are involved in setting up A/B tests for broadcasts?",
        "How does the application facilitate A/B testing for email broadcasts?"
      ]
    }
  ]
}
